testUAT.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><soap:Header><wsa:Action/><wsa:MessageID>urn:uuid:13b4acb4-cbed-4a44-9653-b0ec61887690</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>https://ukid.uat.uk.experian.com/EIHEndpoint</wsa:To><wsse:Security><wsu:Timestamp wsu:Id="Timestamp-eae374ac-2b08-4085-b056-d7a978ab5bfe"><wsu:Created>2012-09-03T14:20:51Z</wsu:Created><wsu:Expires>2012-09-04T09:32:51Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" ValueType="ExperianWASP" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" wsu:Id="SecurityToken-360cdfd9-0664-4a65-a0f0-92a0229bf83a">9C-7C-AB-D4-3C-AD-A5-4B-AE-C8-74-6D-33-37-36-25-4C-B7-8E-DC-6B-C9-8F-09-A8-A2-37-27-AF-13-58-6A-A9-B1-DA-F6-3B-68-83-56-E6-95-81-B4-97-94-6A-16-FF-91-E2-37-55-BB-91-41-08-CA-D0-1B-02-67-28-67-CE-2D-D4-88-DB-4F-24-FD-04-F7-15-E8-66-7A-C6-69-BD-51-19-D2-3C-E4-6B-41-C7-21-AF-FA-14-BC-D4-72-8E-CE-93-FA-C8-9A-D4-2B-CC-C5-E1-0A-65-35-D8-E6-AB-F8-E8-62-BB-1A-07-D3-5B-8D-62-81-58-D2-55-88-CD-E3-6E-D2-9F-47-9E-3A-D1-95-06-AE-0B-4E-E6-72-96-6D-D9-76-6F-52-97-34-E9-2E-57-47-EF-71-8E-39-63-C4-1B-41-9D-3D-98-21-51-EC-3C-A7-E2-B9-91-AF-15-65-6F-A5-8F-9A-DC-83-01-9C-0D-B5-EE-C9-D1-DE-D1-E2-0C-A8-9E-C5-57-77-90-17-B1-A9-0F-7C-AB-38-7B-1C-A1-64-7A-5D-E7-5E-A7-B4-C6-D1-CD-36-8E-CE-85-28-DB-8B-B4-78-20-23-14-F1-0B-F8-D7-B1-36-5B-A0-A4-7F-88-19-2B-E3-51-A6-66-7D-F6-32-C2-87-72-2A-0F-62-8D-48-00-E4-6C-B7-64-49-FE-A1-E6-D1-6F-9A-0F-EB-B2-C9-36-BF-2A-41-A5-F4-C5-DE-12-83-C2-31-AE-84-14-B6-E2-CD-A3-94-23-96-D8-1E-FB-41-87-2D-51-5E-F2-10-DB-E4-FF-5A-6A-89-73-A6-0E-23-91-9C-47-18-62-14-C3-CA-FC-29-D0-96-77-C8-09-18-39-CB-D7-AC-BB-F9-E6-B1-92-62-78-D3-ED-5E-9E-CE-C1-B7-57-83-73-93-79-8D-8B-93-53-AE-9E-98-B0-A0-C6-AE-C5-94-7D-4C-70-9F-6A-1B-41-F2-CA-63-51-B5-7D-DF-76-E7-CC-AB-38-E5-84-56-15-68-24-EA-59-4E-E8-0D-10-70-2C-A1-6B-AB-09-F2-78-8C-DF-DE-42-04-39-46-FA-1B-9E-BA-46-FF-D1-6B-ED-88-9C-24-D9-5E-1E-CA-AB-F0-B8-C4-CA-43-4E-F4-45-46-30-CE-78-AE-7E</wsse:BinarySecurityToken></wsse:Security></soap:Header><soap:Body><ExecuteRequest xmlns="http://schema.uk.experian.com/eih/2011/03"><EIHHeader xmlns="http://schema.uk.experian.com/eih/2011/03/EIHHeader"><ClientUser>ADL</ClientUser><ReferenceId>ADL47EXT9</ReferenceId></EIHHeader><ProcessConfigReference><ProcessConfigName>CRB Check</ProcessConfigName></ProcessConfigReference><ResponseType>Decision Only</ResponseType><Consent>Yes</Consent><PersonalData><Name><Forename>JULIE</Forename><MiddleName></MiddleName><Surname>DAVIES</Surname></Name><BirthDate>1961-06-02</BirthDate></PersonalData><Addresses><Address><AddressDetail><FlatOrApartmentNumber></FlatOrApartmentNumber><HouseName></HouseName><HouseNumber>10</HouseNumber><Address1>GRANGE ROAD</Address1><Address2></Address2><Address3>CHESTER</Address3><Address4></Address4><PostCode>CH2 2AN</PostCode><Country>GB</Country></AddressDetail><TypeOfAddress>UK</TypeOfAddress><AddressStatus>Current</AddressStatus><ResidentFrom>1991-05-03</ResidentFrom><ResidentTo>2012-09-03</ResidentTo></Address></Addresses></ExecuteRequest></soap:Body></soap:Envelope>